UB_Copy/src/DataProcessors/УБ_РегистрацияРЭНаМесяц/УБ_РегистрацияРЭНаМесяц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УБ_РегистрацияРЭНаМесяц</name>
</mdclass:DataProcessor>

UB_Copy/src/Enums/УБ_ВариантыВажностиЗадачи/УБ_ВариантыВажностиЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВариантыВажностиЗадачи</name>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Обычная</name>
  </enumValues>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Enums/УБ_СостоянияБизнесПроцессов/УБ_СостоянияБизнесПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_СостоянияБизнесПроцессов</name>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Остановлен</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Documents/УБ_РасчетЭффективностиСотрудников/УБ_РасчетЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_РасчетЭффективностиСотрудников</name>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеПоказателейРасчетаЗарплаты</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеИтоговыхНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателей</registerRecords>
  <registerRecords>InformationRegister.УБ_СостоянияДокументовРасчетаЭффективностиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяОценкаПоСтандартам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетнойБазы</name>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеРасценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеКритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеФакта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателей</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинкиГраницЭффективности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеНачисления</name>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиСотрудника</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиРуководителя</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПремииПодразделения</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.УБ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредельныйКоэффициентРЭ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отсутствия</name>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.УБ_ПричиныОтсутствия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/DataProcessors/УБ_РегистрацияРЭНаМесяц/ManagerModule.bsl
Процедура СоздатьИЗаполнитьДокументыВФоне(СтруктураПараметров, АдресРезультата) Экспорт

	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) И ЗначениеЗаполнено(СтруктураПараметров.ПериодФормирования) Тогда
		Для каждого Строка из СтруктураПараметров.Сотрудники Цикл
			Если Не ЗначениеЗаполнено(Строка.ДокументРЭ) Тогда	
				Строка.ДокументРЭ = СоздатьДокументРЭ(Строка.Сотрудник, СтруктураПараметров);
				ЗаполнитьДокументРЭ(Строка.ДокументРЭ);
				Строка.ДокументРЭСтрокой = Истина;
	        КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СтруктураПараметров,АдресРезультата);
	
КонецПроцедуры

Функция СоздатьДокументРЭ(Сотрудник, СтруктураПараметров)

	ДокументРЭ = Документы.УБ_РасчетЭффективностиСотрудников.СоздатьДокумент();
	ДокументРЭ.Сотрудник = Сотрудник;
	ДокументРЭ.ПериодРасчета = СтруктураПараметров.ПериодФормирования;
	ДокументРЭ.Организация = СтруктураПараметров.Организация;
	ДокументРЭ.Подразделение = СтруктураПараметров.Подразделение;
	ДокументРЭ.НачалоПериода = НачалоМесяца(СтруктураПараметров.ПериодФормирования);
	ДокументРЭ.КонецПериода = КонецМесяца(СтруктураПараметров.ПериодФормирования);
	ДокументРЭ.Дата = ТекущаяДата();
	ДокументРЭ.Записать();
	
	Возврат ДокументРЭ.Ссылка;
	
КонецФункции

Процедура ЗаполнитьДокументРЭ(ДокументРЭ)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Организация", ДокументРЭ.Организация);
	СтруктураПараметров.Вставить("Подразделение", ДокументРЭ.Подразделение);
	СтруктураПараметров.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументРЭ.Сотрудник));
	СтруктураПараметров.Вставить("МесяцНачисления", ДокументРЭ.НачалоПериода);
	СтруктураПараметров.Вставить("ДокументРЭ", ДокументРЭ);
	
	СтруктураРезультата = Документы.УБ_РасчетЭффективностиСотрудников.ПодготовитьДанныеНачисленийГрупповогоСоздания(СтруктураПараметров);
	
	СтруктураПараметров.Вставить("СтруктураРезультата",СтруктураРезультата);
	
	ПриЗавершенииОперацииЗаполненияНачислений(СтруктураПараметров);
	
КонецПроцедуры 

Процедура ПриЗавершенииОперацииЗаполненияНачислений(ДополнительныеПараметры)
	
	ДополнительныеПараметры.Вставить("СохранятьИсправления", Ложь);
	ДополнительныеПараметры.Вставить("ТекстОповещения");
	ДополнительныеПараметры.Вставить("ПояснениеОповещения");
	ДополнительныеПараметры.Вставить("ЕстьДанныеДляЗаполнения", Ложь);
	
	ПриЗавершенииОперацииЗаполненияНачисленийНаСервере(ДополнительныеПараметры,ДополнительныеПараметры.ДокументРЭ);
		
КонецПроцедуры

Процедура ПриЗавершенииОперацииЗаполненияНачисленийНаСервере(Результат, ДокументРЭ)
	
	ДокументРЭОбъект = ДокументРЭ.ПолучитьОбъект();
	Документы.УБ_РасчетЭффективностиСотрудников.ЗаполнениеПослеВыполненияДлительнойОперацииГрупповогоСоздания(ДокументРЭОбъект, Результат);
	ДокументРЭОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура СоздатьИЗаполнитьДокументыИЗадачиВФоне(СтруктураПараметров, АдресРезультата) Экспорт

	Если ЗначениеЗаполнено(СтруктураПараметров.Организация) И ЗначениеЗаполнено(СтруктураПараметров.ПериодФормирования) Тогда

		Для каждого Строка из СтруктураПараметров.Сотрудники Цикл
			Если Не ЗначениеЗаполнено(Строка.ДокументРЭ) Тогда 
				Строка.ДокументРЭ = СоздатьДокументРЭ(Строка.Сотрудник, СтруктураПараметров);
				ЗаполнитьДокументРЭ(Строка.ДокументРЭ);
				Строка.ДокументРЭСтрокой = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Строка.Задача) И Строка.СоздаватьЗадачу Тогда
				Если Строка.Исполнитель = "Руководитель" Тогда
					Если Не СтруктураПараметров.ЗадачаРуководителя Тогда
						Строка.Задача = СоздатьЗадачиИсполнителяРаспределение(Строка.Сотрудник, Строка.Исполнитель, Строка.ДокументРЭ,СтруктураПараметров);
					КонецЕсли;
				Иначе
					Строка.Задача = СоздатьЗадачиИсполнителяРаспределение(Строка.Сотрудник, Строка.Исполнитель, Строка.ДокументРЭ,СтруктураПараметров);
				КонецЕсли;
				Строка.ЗадачаСтрокой = Истина;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция СоздатьЗадачиИсполнителяРаспределение(Сотрудник, Исполнитель, ДокументРЭ,СтруктураПараметров)
	
	Если Константы.УБ_ИспользоватьСправочникиКАУП.Получить() Тогда
		Возврат СоздатьЗадачиИсполнителяКАУП(Сотрудник, Исполнитель, ДокументРЭ,СтруктураПараметров);
	Иначе
		Возврат СоздатьЗадачиИсполнителяУБ(Сотрудник, Исполнитель, ДокументРЭ,СтруктураПараметров);
	КонецЕсли;	
	
КонецФункции
	
&НаСервере
Функция СоздатьЗадачиИсполнителяУБ(Сотрудник, Исполнитель, ДокументРЭ,СтруктураПараметров)
	
	ИсполнительЗадачи = ОпределитьИсполнителя(Сотрудник, Исполнитель,СтруктураПараметров);
	Если ЗначениеЗаполнено(ИсполнительЗадачи) Тогда
		РольИсполнителя = Справочники.УБ_РолиИсполнителей.ИсполнительЗадачи;
	
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.УБ_ГруппыИсполнителейЗадач ГДЕ РольИсполнителя = &Роль И ОсновнойОбъектАдресации = &Объект";
		Запрос.УстановитьПараметр("Роль", РольИсполнителя);
		Запрос.УстановитьПараметр("Объект", СтруктураПараметров.Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ГруппаИсполнителейСсылка = Выборка.Ссылка;
		Иначе
			ГруппаИсполнителейОбъект = Справочники.УБ_ГруппыИсполнителейЗадач.СоздатьЭлемент();
			ГруппаИсполнителейОбъект.Наименование = НСтр("ru = 'Группа исполнителей задач организации'");
			ГруппаИсполнителейОбъект.РольИсполнителя = РольИсполнителя;
			ГруппаИсполнителейОбъект.ОсновнойОбъектАдресации = СтруктураПараметров.Организация;
			ГруппаИсполнителейОбъект.Записать();
			ГруппаИсполнителейСсылка = ГруппаИсполнителейОбъект.Ссылка;
		КонецЕсли;
		
		ВажностьОбычная = Перечисления.УБ_ВариантыВажностиЗадачи.Обычная;
		СостояниеАктивен = Перечисления.УБ_СостоянияБизнесПроцессов.Активен;
		
		Наименование = НСтр("ru = 'Задание на заполнение документа РЭ'");
		БПЗаданиеОбъект = БизнесПроцессы.УБ_Задание.СоздатьБизнесПроцесс();
		БПЗаданиеОбъект.Наименование = Наименование;
		БПЗаданиеОбъект.Важность                = ВажностьОбычная;
		БПЗаданиеОбъект.Дата                    = ТекущаяДата();
		БПЗаданиеОбъект.Автор                   = СтруктураПараметров.ТекущийПользователь;
		БПЗаданиеОбъект.АвторСтрокой            = Строка(СтруктураПараметров.ТекущийПользователь);
		БПЗаданиеОбъект.Исполнитель             = ИсполнительЗадачи;
		БПЗаданиеОбъект.Предмет                 = ДокументРЭ;
		БПЗаданиеОбъект.ОсновнойОбъектАдресации = СтруктураПараметров.Организация;
		БПЗаданиеОбъект.СрокИсполнения          = РассчитатьДату(СтруктураПараметров);
		БПЗаданиеОбъект.Состояние               = СостояниеАктивен;
		БПЗаданиеОбъект.Стартован               = Истина;
		БПЗаданиеОбъект.НаПроверке              = Истина;
		БПЗаданиеОбъект.НомерИтерации           = 1;
		БПЗаданиеОбъект.Проверяющий             = ?(ЗначениеЗаполнено(СтруктураПараметров.КонтролирующееЛицо), СтруктураПараметров.КонтролирующееЛицо,СтруктураПараметров.ТекущийПользователь);
		БПЗаданиеОбъект.Записать();
		БПЗаданиеСсылка = БПЗаданиеОбъект.Ссылка;
		
		Наименование = НСтр("ru = 'Заполнить документ(ы) РЭ'");
		ЗадачаИсполнителяОбъект = Задачи.УБ_ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаИсполнителяОбъект.Наименование = Наименование;
		ЗадачаИсполнителяОбъект.Дата                    = ТекущаяДата();
		ЗадачаИсполнителяОбъект.БизнесПроцесс           = БПЗаданиеСсылка;
		ЗадачаИсполнителяОбъект.Важность                = ВажностьОбычная;
		ЗадачаИсполнителяОбъект.Описание                = "Заполнить документ(ы) РЭ";
		ЗадачаИсполнителяОбъект.Предмет                 = ДокументРЭ;
		ЗадачаИсполнителяОбъект.ПредметСтрокой          = Строка(ДокументРЭ);
		ЗадачаИсполнителяОбъект.Автор                   = СтруктураПараметров.ТекущийПользователь;
		ЗадачаИсполнителяОбъект.АвторСтрокой            = Строка(СтруктураПараметров.ТекущийПользователь);
		ЗадачаИсполнителяОбъект.ТочкаМаршрута           = БизнесПроцессы.УБ_Задание.ТочкиМаршрута.Выполнить;
		ЗадачаИсполнителяОбъект.ГруппаИсполнителейЗадач = ГруппаИсполнителейСсылка;
		ЗадачаИсполнителяОбъект.ОсновнойОбъектАдресации = СтруктураПараметров.Организация;
		ЗадачаИсполнителяОбъект.РольИсполнителя         = РольИсполнителя;
		ЗадачаИсполнителяОбъект.СостояниеБизнесПроцесса = СостояниеАктивен;
		ЗадачаИсполнителяОбъект.СрокИсполнения          = РассчитатьДату(СтруктураПараметров);
		ЗадачаИсполнителяОбъект.Записать();
		Возврат ЗадачаИсполнителяОбъект.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция СоздатьЗадачиИсполнителяКАУП(Сотрудник, Исполнитель, ДокументРЭ,СтруктураПараметров)
	
	ИсполнительЗадачи = ОпределитьИсполнителя(Сотрудник, Исполнитель, СтруктураПараметров);
	Если ЗначениеЗаполнено(ИсполнительЗадачи) Тогда
		
		ВажностьОбычная = Перечисления.ВариантыВажностиЗадачи.Обычная;
		СостояниеАктивен = Перечисления.СостоянияБизнесПроцессов.Активен;
		
		Наименование = НСтр("ru = 'Задание на заполнение документа РЭ'");
		БПЗаданиеОбъект = БизнесПроцессы.CRM_БизнесПроцесс.СоздатьБизнесПроцесс();
		БПЗаданиеОбъект.Наименование = Наименование;
		БПЗаданиеОбъект.Важность                = ВажностьОбычная;
		БПЗаданиеОбъект.Дата                    = ТекущаяДата();
		БПЗаданиеОбъект.Автор                   = СтруктураПараметров.ТекущийПользователь;
		БПЗаданиеОбъект.АвторСтрокой            = Строка(СтруктураПараметров.ТекущийПользователь);
		БПЗаданиеОбъект.Исполнитель             = ИсполнительЗадачи;
		БПЗаданиеОбъект.Предмет                 = ДокументРЭ;
		БПЗаданиеОбъект.ОсновнойОбъектАдресации = СтруктураПараметров.Организация;
		БПЗаданиеОбъект.СрокИсполнения          = РассчитатьДату(СтруктураПараметров);
		БПЗаданиеОбъект.Состояние               = СостояниеАктивен;
		БПЗаданиеОбъект.Стартован               = Истина;
		БПЗаданиеОбъект.НаПроверке              = Истина;
		БПЗаданиеОбъект.НомерИтерации           = 1;
		БПЗаданиеОбъект.Проверяющий             = ?(ЗначениеЗаполнено(СтруктураПараметров.КонтролирующееЛицо), СтруктураПараметров.КонтролирующееЛицо,СтруктураПараметров.ТекущийПользователь);
		БПЗаданиеОбъект.Записать();
		БПЗаданиеСсылка = БПЗаданиеОбъект.Ссылка;
		
		Наименование = НСтр("ru = 'Заполнить документ(ы) РЭ'");
		ЗадачаИсполнителяОбъект = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаИсполнителяОбъект.Наименование = Наименование;
		ЗадачаИсполнителяОбъект.Дата                    = ТекущаяДата();
		ЗадачаИсполнителяОбъект.БизнесПроцесс           = БПЗаданиеСсылка;
		ЗадачаИсполнителяОбъект.Важность                = ВажностьОбычная;
		ЗадачаИсполнителяОбъект.Исполнитель             = ИсполнительЗадачи;
		ЗадачаИсполнителяОбъект.Описание                = "Заполнить документ(ы) РЭ";
		ЗадачаИсполнителяОбъект.Предмет                 = ДокументРЭ;
		ЗадачаИсполнителяОбъект.ПредметСтрокой          = Строка(ДокументРЭ);
		ЗадачаИсполнителяОбъект.Автор                   = СтруктураПараметров.ТекущийПользователь;
		ЗадачаИсполнителяОбъект.АвторСтрокой            = Строка(СтруктураПараметров.ТекущийПользователь);
		ЗадачаИсполнителяОбъект.ТочкаМаршрута           = БизнесПроцессы.CRM_БизнесПроцесс.ТочкиМаршрута.Старт;
		ЗадачаИсполнителяОбъект.ОсновнойОбъектАдресации = СтруктураПараметров.Организация;
		ЗадачаИсполнителяОбъект.СостояниеБизнесПроцесса = СостояниеАктивен;
		ЗадачаИсполнителяОбъект.СрокИсполнения          = РассчитатьДату(СтруктураПараметров);
		ЗадачаИсполнителяОбъект.Записать();
		Возврат ЗадачаИсполнителяОбъект.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция РассчитатьДату(СтруктураПараметров)

	ДатаОкончанияЗаполнения = Константы.УБ_ДатаОкончанияЗаполненияРЭ.Получить();
	ДатаСтрокой = Строка(СтруктураПараметров.ПериодФормирования);
	Если ДатаОкончанияЗаполнения = 0 Тогда
		ДатаИсполнения = "01" + Сред(ДатаСтрокой,3,СтрДлина(ДатаСтрокой)-2);
	Иначе
		ДеньСтрокой = Формат(ДатаОкончанияЗаполнения, "ЧЦ=2; ЧВН=");
	   	ДатаИсполнения = ДеньСтрокой + Сред(ДатаСтрокой,3,СтрДлина(ДатаСтрокой)-2);
		ДатаИсполнения = ДобавитьМесяц(ДатаИсполнения,1);
	КонецЕсли;
	Возврат НачалоДня(ДатаИсполнения)+18*60*60;
КонецФункции	

&НаСервере
Функция ОпределитьИсполнителя(Сотрудник, Исполнитель,СтруктураПараметров)

	Если Исполнитель = "Руководитель" Тогда
		СтруктураПараметров.ЗадачаРуководителя = Истина;
		Возврат НайтиПользователяУСотрудника(СтруктураПараметров.Руководитель);
	ИначеЕсли Исполнитель = "Зам.Руководитель" Тогда
		Возврат НайтиПользователяУСотрудника(СтруктураПараметров.Зам_Руководителя);
	ИначеЕсли Исполнитель = "Контролирующее лицо" Тогда
		Возврат СтруктураПараметров.КонтролирующееЛицо;
	ИначеЕсли Исполнитель = "Сотрудник" Тогда
		Возврат НайтиПользователяУСотрудника(Сотрудник);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиПользователяУСотрудника(Сотрудник)

	ФизическоеЛицо = Сотрудник.ФизическоеЛицо;
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо",ФизическоеЛицо);
		Если ЗначениеЗаполнено(Пользователь) Тогда
			Возврат Пользователь;
		Иначе
			Сообщить("К сотруднику " + Строка(Сотрудник) + " не привязан пользователь");
			Возврат Неопределено;
		КонецЕсли;	
	Иначе
		Сообщить("У сотрудника " + Строка(Сотрудник) + " незаполнено физ. лицо");
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции
